In [1]:
import pandas as pd

In [2]:
col = cols = {'name': ['Adnan', 'john', 'Sami'],
             'age': [22, 21, 24]}

In [4]:
df = pd.DataFrame(cols)

In [5]:
df

   age   name
0   22  Adnan
1   21   john
2   24   Sami

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
age     3 non-null int64
name    3 non-null object
dtypes: int64(1), object(1)
memory usage: 128.0+ bytes

In [8]:
df.columns

Index(['age', 'name'], dtype='object')

In [9]:
df.age

0    22
1    21
2    24
Name: age, dtype: int64

In [10]:
df.name

0    Adnan
1     john
2     Sami
Name: name, dtype: object

In [11]:
df['age']

0    22
1    21
2    24
Name: age, dtype: int64

In [13]:
df.describe()

             age
count   3.000000
mean   22.333333
std     1.527525
min    21.000000
25%    21.500000
50%    22.000000
75%    23.000000
max    24.000000

# Similarities to python dictonaries

In [14]:
df

   age   name
0   22  Adnan
1   21   john
2   24   Sami

In [17]:
df['last'] = pd.Series(['Sam', 'Hasan', 'Jabi'], index=[0, 2, 1])

In [18]:
df

   age   name   last
0   22  Adnan    Sam
1   21   john   Jabi
2   24   Sami  Hasan

In [19]:
df['instrument'] = ['Flute', 'Piano', 'Guitar']

In [20]:
df

   age   name   last instrument
0   22  Adnan    Sam      Flute
1   21   john   Jabi      Piano
2   24   Sami  Hasan     Guitar

In [21]:
df['birthplace'] = 'Real Madrid'

In [22]:
df

   age   name   last instrument   birthplace
0   22  Adnan    Sam      Flute  Real Madrid
1   21   john   Jabi      Piano  Real Madrid
2   24   Sami  Hasan     Guitar  Real Madrid

In [23]:
df.instrument

0     Flute
1     Piano
2    Guitar
Name: instrument, dtype: object

In [24]:
df['instrument']

0     Flute
1     Piano
2    Guitar
Name: instrument, dtype: object

In [25]:
df[['name', 'last']]

    name   last
0  Adnan    Sam
1   john   Jabi
2   Sami  Hasan

In [26]:
df

   age   name   last instrument   birthplace
0   22  Adnan    Sam      Flute  Real Madrid
1   21   john   Jabi      Piano  Real Madrid
2   24   Sami  Hasan     Guitar  Real Madrid

In [27]:
del df['last']

In [28]:
df

   age   name instrument   birthplace
0   22  Adnan      Flute  Real Madrid
1   21   john      Piano  Real Madrid
2   24   Sami     Guitar  Real Madrid

In [30]:
df.pop('birthplace')

0    Real Madrid
1    Real Madrid
2    Real Madrid
Name: birthplace, dtype: object

In [31]:
df

   age   name instrument
0   22  Adnan      Flute
1   21   john      Piano
2   24   Sami     Guitar

# Creation from Lists & Dicts

In [32]:
col = {'name': ['Adnan', 'John', 'Sham'],
      'age': [22, 18, 29]}

In [37]:
df = pd.DataFrame(cols, columns=['name', 'age'])

In [35]:
df

    name  age
0  Adnan   22
1   john   21
2   Sami   24

In [38]:
rows = [{'name':'Adnan', 'age': 24},
       {'name': 'Lara', 'age': 22},
       {'name': 'Doli', 'age':33}]

In [39]:
df = pd.DataFrame(rows)

In [40]:
df

   age   name
0   24  Adnan
1   22   Lara
2   33   Doli

In [43]:
import json
col_json = json.dumps(cols)
col_json

'{"name": ["Adnan", "john", "Sami"], "age": [22, 21, 24]}'

In [44]:
df = pd.read_json(col_json)

In [45]:
df

   age   name
0   22  Adnan
1   21   john
2   24   Sami

In [48]:
row_json = json.dumps(rows)
row_json
df = pd.read_json(row_json)

In [49]:
df

   age   name
0   24  Adnan
1   22   Lara
2   33   Doli

# Read CSV file using DataFrame

In [52]:
more temp.csv

In [54]:
filename = 'temp.csv'
df = pd.read_csv(filename)

In [55]:
df

  Index  Temp3
0     T     45
1     W     70
2    Th    100
3     S     20
4     M     80